# Data loading,Storage, and File format

In [1]:
import pandas as pd
import numpy as np

Since this is comma-delimited, we can use read_csv to read it into a DataFrame.

In [2]:
df = pd.read_csv("ex.csv") # use comma as default delimiter

In [3]:
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [4]:
df1 = pd.read_table("ex.csv",sep = ",")   # specified the delimiter

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [5]:
df1

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [6]:
!type "ex.csv"

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

To read this file, you have a couple of options. You can allow pandas to assign default
column names, or you can specify names yourself.

In [7]:
df2 = pd.read_csv("ex.csv",header = None)

 header ::    Row number to use as column names; defaults to 0 (first row), but should be None if there is no
header row

In [8]:
df2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
pd.read_csv("ex.csv",names = ["a","b","c","d","message"]) # by custom column

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
pd.read_csv("ex.csv",names = ["a","b","c","d","message"],index_col= "message") # indexing through any column

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
pd.read_csv("ex.csv",index_col =[0,"hello"]) # indexing multiple column

          2   3   4
1 hello
5 world   6   7   8
9 foo    10  11  12

In [12]:
list(open("ex3.txt"))

[" A B C\\n',\n",
 "'aaa -0.264438 -1.026059 -0.619500\\n',\n",
 "'bbb 0.927272 0.302904 -0.032399\\n',\n",
 "'ccc -0.264273 -0.386314 -0.217601\\n',\n",
 "'ddd -0.871858 -0.348382 1.100491\\n'"]

In [13]:
pd.read_table("ex3.txt",sep = "\s+")

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

             A         B          C\n',
'aaa -0.264438 -1.026059  -0.619500\n',
'bbb  0.927272  0.302904  -0.032399\n',
'ccc -0.264273 -0.386314  -0.217601\n',
'ddd -0.871858 -0.348382    1.100491\n'

In [17]:
f1 =pd.read_csv("ex4.csv")
f1

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [22]:
pd.read_csv("ex4.csv",skiprows = [0,2,3]) # skip the first, third, and fourth rows of a file with skiprows

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
result = pd.read_csv("ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

Handling missing values is an important and frequently nuanced part of the file parsing
process. Missing data is usually either not present (empty string) or marked by
some sentinel value. By default, pandas uses a set of commonly occurring sentinels,
such as NA and NULL.

In [26]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [27]:
pd.notnull(result)

   something     a     b      c     d  message
0       True  True  True   True  True    False
1       True  True  True  False  True     True
2       True  True  True   True  True     True

In [29]:
result1 = pd.read_csv('ex5.csv', na_values=['NULL'])

In [30]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [31]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [32]:
pd.read_csv("ex5.csv", na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

# Reading_text_file_in_piece

When processing very large files or figuring out the right set of arguments to correctly
process a large file, you may only want to read in a small piece of a file or iterate
through smaller chunks of the file.

In [34]:
pd.options.display.max_rows = 10

In [37]:
result2 = pd.read_csv("ex6.csv")

In [38]:
result2

   one  two  three  four key
0    1    2      3     4   l
1    5    6      7     8   m
2   10   11     12    13   n
3   14   15     16    17   o
4   18   19     20    21   p
5   22   23     24    25   q
6   26   27     28    29   r
7   30   31     32    34   s
8  363   78     67    56   h
9   78   79     20    67   y

If you want to only read a small number of rows (avoiding reading the entire file),
specify that with nrows:

In [40]:
pd.read_csv("ex6.csv",nrows= 5)

   one  two  three  four key
0    1    2      3     4   l
1    5    6      7     8   m
2   10   11     12    13   n
3   14   15     16    17   o
4   18   19     20    21   p

# Writing Data to Text Format

In [42]:
data = pd.read_csv("ex5.csv")

In [43]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [45]:
import sys

In [46]:
data.to_csv(sys.stdout,sep ="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [47]:
data.to_csv(sys.stdout,na_rep = "null")

,something,a,b,c,d,message
0,one,1,2,3.0,4,null
1,two,5,6,null,8,world
2,three,9,10,11.0,12,foo

In [48]:
#With no other options specified, both the row and column labels are written. Both of
#these can be disabled
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [53]:

data.to_csv(sys.stdout,index = False,columns = ["a","b","c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [60]:
# Series also has a to_csv method
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [59]:
ts.to_csv("tseries.csv")

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

# Working with Delimited Formats

In [62]:
import csv
f = open('ex6.csv')
reader = csv.reader(f)

In [63]:
for line in reader:
    print(line)

['one', 'two', 'three', 'four', 'key']
['1', '2', '3', '4', 'l']
['5', '6', '7', '8', 'm']
['10', '11', '12', '13', 'n']
['14', '15', '16', '17', 'o']
['18', '19', '20', '21', 'p']
['22', '23', '24', '25', 'q']
['26', '27', '28', '29', 'r']
['30', '31', '32', '34', 's']
['363', '78', '67', '56', 'h']
['78', '79', '20', '67', 'y']

In [65]:
header, values = line[0], line[1:]

In [66]:
header

'78'

In [67]:
values

['79', '20', '67', 'y']

In [68]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [69]:
data_dict

{'7': ('7', '2', '6', 'y')}

# JSON_data

JSON (short for JavaScript Object Notation) has become one of the standard formats
for sending data by HTTP request between web browsers and other applications.

In [70]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [71]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [72]:
pd.read_json("example.json")

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [76]:
t1 = pd.read_html("FDIC_ Failed Bank List.html")

In [77]:
len(t1)

1

In [79]:
failures = t1[0]

In [80]:
failures

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"
...,...,...,...,...,...,...,...
20,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","November 15, 2017"
21,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 3, 2018"
22,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","November 10, 2016"
23,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016"
24,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","February 19, 2018"

In [81]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

# Binary Data Formats

One of the easiest ways to store data (also known as serialization) efficiently in binary
format is using Python’s built-in pickle serialization. pandas objects all have a
to_pickle method that writes the data to disk in pickle format.

In [83]:
frame = pd.read_csv("ex.csv")
frame

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [85]:
frame.to_pickle("frame_pickle")

In [86]:
pd.read_pickle("frame_pickle")

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [87]:
frame1 = pd.DataFrame({"a":np.random.randn(100)})
frame1

           a
0   0.524117
1  -0.178594
2   0.241497
3  -0.043946
4   1.506928
..       ...
95  1.035387
96 -1.482237
97  0.005070
98  0.846458
99 -0.794819

[100 rows x 1 columns]

In [88]:
store = pd.HDFStore("mydata.h5")

In [89]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [92]:
store["obj1"] = frame1

In [93]:
store["obj1_col"] = frame1["a"]

In [94]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [95]:
store["obj1"]

           a
0   0.524117
1  -0.178594
2   0.241497
3  -0.043946
4   1.506928
..       ...
95  1.035387
96 -1.482237
97  0.005070
98  0.846458
99 -0.794819

[100 rows x 1 columns]

In [100]:
store.put('obj2', frame1, format='fixed')

In [101]:
store["obj2"]

           a
0   0.524117
1  -0.178594
2   0.241497
3  -0.043946
4   1.506928
..       ...
95  1.035387
96 -1.482237
97  0.005070
98  0.846458
99 -0.794819

[100 rows x 1 columns]

# interacting_with_web_API

In [102]:
import requests

In [103]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [104]:
resp = requests.get(url)

In [105]:
resp

In [106]:
data = resp.json()

In [109]:
data[0]["title"]

'PERF: asv for import'